# Индивидуальная практическая работа 1 по дисциплине ЛОИС
# Выполнена студентом группы 221703 БГУИР Фурс Алексей Михайлович и Вечорко Дмитрий Николаевич
# Основные методы для нахождения прямого нечёткого вывода
# Последние изменения: 03.11.2024, версия: 1
#
# Использованные источники:
# Логические основы интеллектуальных систем. Практикум: учебно-методическое пособие / В.В.Голенков, В.П.Ивашенко, Д.Г.Колб, К.А.Уваров. – Минск: БГУИР, 2011.
from fuzzy_logic import algorithm

if __name__ == "__main__":
    algorithm("input2.txt")
